package com.example.myapplication;

import android.app.Application;

// מחלקת תשתית ראשית המרחיבה את מחלקת Application של מערכת ההפעלה אנדרואיד
// מחלקה זו מייצגת את מחזור החיים הגלובלי של האפליקציה כולה (ולא רק של מסך בודד)
public class MyApplication extends Application {

    @Override
    // פונקציית ה-OnCreate הגלובלית - זוהי נקודת הכניסה וההרצה הראשונה של הקוד במערכת
    // היא מופעלת פעם אחת בלבד בעת עליית האפליקציה לזיכרון, עוד לפני שנוצר האקטיביטי הראשון
    public void onCreate() {
        // קריאה לפונקציית האם המובנית של אנדרואיד לצורך אתחול תקין של רכיבי מערכת ההפעלה במכשיר
        super.onCreate();

        // מקום זה מיועד בעתיד להוספת פקודות אתחול גלובליות (כמו אתחול ידני של ספריות Firebase וכדומה)
    }
}